# PROJETO 1 - Preparando os Dados

## Introdução

Descrição aqui

In [1]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os

In [2]:
print('Esperamos trabalhar no diretório')
print(os.getcwd())

Esperamos trabalhar no diretório
/Users/Lucanoto/Desktop/Projeto 1

# Abrindo os arquivos

In [3]:
dados01 = pd.read_csv("PES2001.csv", sep=",") # Abrindo o PNAD de 2001
dados14 = pd.read_csv("PES2014.csv", sep=",") # Abrindo o PNAD de 2014
print('Hora do show!')

Hora do show!

# Arrumando o nome da variável UF

In [4]:
dados14 = dados14.rename(columns = {'UF   ':'UF'})
dados01 = dados01.rename(columns = {'uf':'UF'})

## Selecionando os grupos de comparação

In [5]:
aposentados14 = dados14[dados14.V9122==2]
aposentados14.head()

,Unnamed: 0,V0101,UF,V0102,V0103,V0301,V0302,V3031,V3032,V3033,...,V4741,V4742,V4743,V4745,V4746,V4747,V4748,V4749,V4750,V9993
5,5,2014,11,15,3,1,4,5,1,1937,...,1,724,3,2,2,NaN,NaN,2,724,20160623
11,11,2014,11,15,5,1,4,13,7,1946,...,4,855,4,2,2,NaN,NaN,2,855,20160623
25,25,2014,11,15,10,1,2,15,10,1948,...,2,2362,6,2,1,1,1,1,2362,20160623
26,26,2014,11,15,10,2,4,24,6,1952,...,2,2362,6,5,2,NaN,NaN,2,2362,20160623
51,51,2014,11,23,1,5,2,25,1,1924,...,5,444,3,1,2,NaN,NaN,2,444,20160623

In [6]:
aposentados01 = dados01[dados01.v9122==2]
aposentados01.head()

,v0101,UF,v0102,v0103,v0301,v0302,v3031,v3032,v3033,v8005,...,v2201,v2202,v1623,v1624,v1625,v1626,v1627,v1628,v1629,v1630
11,2001,11,11000000,3,3,2,19,3,1918,83,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,2001,11,11000000,6,1,2,17,12,1916,84,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,2001,11,11000000,10,3,4,26,4,1933,68,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
54,2001,11,11000000,16,1,2,12,12,1939,61,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
55,2001,11,11000000,16,2,4,5,9,1940,61,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Selecionando as Variáveis

In [8]:
aposentados01 = aposentados01[['UF','v0302','v8005','v0404','v0601','v0602','v0603','v9122','v1251','v1252','v4754','v4757','v4770','v4728','v4703','v0402']]
aposentados14 = aposentados14[['UF','V0302','V8005','V0404','V0601','V0602','V6003','V9122','V1251','V1252','V4704','V4707','V4720','V4728','V4803','V0402']]

# Renomeando as Colunas (nome das variáveis)

In [9]:
aposentados01.columns = ['UF','SEXO','IDADE','COR','ALFABETIZADO','ESCOLA_CRECHE','CURSO','APOSENTADO', 'APOSENTADORIA', 'VALOR_APOSENTADORIA','PEA','HORAS_TRABALHO','REND_MEN_TOT','SIT_CENSITARIA','ANOS_ESTUDO','COND_FAMILIAR']
aposentados14.columns = ['UF','SEXO','IDADE','COR','ALFABETIZADO','ESCOLA_CRECHE','CURSO','APOSENTADO', 'APOSENTADORIA', 'VALOR_APOSENTADORIA','PEA','HORAS_TRABALHO','REND_MEN_TOT','SIT_CENSITARIA','ANOS_ESTUDO','COND_FAMILIAR']

# Criando coluna 'Regiões' e 'Salários Mínimos'

In [10]:
aposentados01.insert(1,'REGIAO',0)
aposentados14.insert(1,'REGIAO',0)

aposentados01.insert(12,'SAL_MIN',0)
aposentados14.insert(12,'SAL_MIN',0)

## "Distribuindo" os estados em cada região

#### PNAD 2001

In [11]:
aposentados01.ix[aposentados01.UF <= 17,'REGIAO'] = 'Norte'
aposentados01.ix[(aposentados01.UF >=21) & (aposentados01.UF<=29),'REGIAO'] = 'Nordeste'
aposentados01.ix[(aposentados01.UF >=31) & (aposentados01.UF<=35),'REGIAO'] = 'Sudeste'
aposentados01.ix[(aposentados01.UF >=41) & (aposentados01.UF<=43),'REGIAO'] = 'Sul'
aposentados01.ix[aposentados01.UF >=50 ,'REGIAO'] = 'CentroOeste'

print('Comando executado')

Comando executado

//anaconda/lib/python3.5/site-packages/pandas/core/indexing.py:426: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

#### PNAD 2014

In [12]:
aposentados14.ix[aposentados14.UF <= 17,'REGIAO'] = 'Norte'
aposentados14.ix[(aposentados14.UF >=21) & (aposentados14.UF<=29),'REGIAO'] = 'Nordeste'
aposentados14.ix[(aposentados14.UF >=31) & (aposentados14.UF<=35),'REGIAO'] = 'Sudeste'
aposentados14.ix[(aposentados14.UF >=41) & (aposentados14.UF<=43),'REGIAO'] = 'Sul'
aposentados14.ix[aposentados14.UF >=50 ,'REGIAO'] = 'CentroOeste'

print('Comando executado')

Comando executado

# Salvando os Dataframes em 2 novos arquivos .csv

In [13]:
aposentados01.to_csv('dados_preparados_2001.csv')
aposentados14.to_csv('dados_preparados_2014.csv')

print('Comando executado')

Comando executado

In [ ]:
#salario min 2001 =180 e 2014 724 reais